# Module 1: Data validation and pre-processing technique

In [1]:
#import library packages
import pandas as p

#### House price dataset

In [2]:
#Load given dataset
data = p.read_csv("price.csv")

In [3]:
import warnings
warnings.filterwarnings('ignore')

Before drop the given dataset

In [4]:
data.head()

,Price,Area,No. of Bedrooms,Gymnasium,SwimmingPool,IndoorGames,ClubHouse,CarParking,Hospital,Children'splayarea,LiftAvailable,GolfCourse,city
0,30000000,3340,4,1,1,1,1,0,0,1,1,0,Bangalore
1,7888000,1045,2,1,1,1,1,1,0,1,1,0,Bangalore
2,4866000,1179,2,1,1,0,0,0,0,1,1,0,Bangalore
3,8358000,1675,3,0,0,0,0,0,0,0,1,0,Bangalore
4,6845000,1670,3,1,1,1,1,1,0,1,1,0,Bangalore

In [5]:
#shape
data.shape

(10093, 13)

After drop the given dataset

In [6]:
df=data.dropna()

In [7]:
#shape
df.shape

(10093, 13)

In [8]:
#show columns
df.columns

Index(['Price', 'Area', 'No. of Bedrooms', 'Gymnasium', 'SwimmingPool',
       'IndoorGames', 'ClubHouse', 'CarParking', 'Hospital',
       'Children'splayarea', 'LiftAvailable', 'GolfCourse', 'city'],
      dtype='object')

In [9]:
#To describe the dataframe
df.describe()

,Price,Area,No. of Bedrooms,Gymnasium,SwimmingPool,IndoorGames,ClubHouse,CarParking,Hospital,Children'splayarea,LiftAvailable,GolfCourse
count,1.009300e+04,10093.000000,10093.000000,10093.000000,10093.000000,10093.000000,10093.000000,10093.000000,10093.000000,10093.000000,10093.000000,10093.000000
mean,1.036314e+07,1349.034777,2.459625,0.520757,0.414941,0.274349,0.419796,0.465372,0.056871,0.513425,0.716536,0.021599
std,1.360081e+07,707.857363,0.759717,0.499594,0.492736,0.446208,0.493550,0.498824,0.231608,0.499844,0.450702,0.145378
min,2.000000e+06,200.000000,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,4.500000e+06,935.000000,2.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
50%,6.970999e+06,1200.000000,2.000000,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,1.000000,1.000000,0.000000
75%,1.180000e+07,1603.000000,3.000000,1.000000,1.000000,1.000000,1.000000,1.000000,0.000000,1.000000,1.000000,0.000000
max,4.000000e+08,9900.000000,8.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000

In [10]:
#Checking datatype and information about dataset
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10093 entries, 0 to 10092
Data columns (total 13 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Price               10093 non-null  int64
 1   Area                10093 non-null  int64
 2   No. of Bedrooms     10093 non-null  int64
 3   Gymnasium           10093 non-null  int64
 4   SwimmingPool        10093 non-null  int64
 5   IndoorGames         10093 non-null  int64
 6   ClubHouse           10093 non-null  int64
 7   CarParking          10093 non-null  int64
 8   Hospital            10093 non-null  int64
 9   Children'splayarea  10093 non-null  int64
 10  LiftAvailable       10093 non-null  int64
 11  GolfCourse          10093 non-null  int64
 12  city                10093 non-null  object
dtypes: int64(12), object(1)
memory usage: 1.0+ MB

Checking duplicate values of dataframe

In [11]:
#Checking for duplicate data
df.duplicated()

0        False
1        False
2        False
3        False
4        False
         ...
10088    False
10089     True
10090    False
10091    False
10092    False
Length: 10093, dtype: bool

In [12]:
#find sum of duplicate data
sum(df.duplicated())

2355

In [13]:
df = df.drop_duplicates()

In [14]:
sum(df.duplicated())

0

In [15]:
#Checking sum of missing values
df.isnull().sum()

Price                 0
Area                  0
No. of Bedrooms       0
Gymnasium             0
SwimmingPool          0
IndoorGames           0
ClubHouse             0
CarParking            0
Hospital              0
Children'splayarea    0
LiftAvailable         0
GolfCourse            0
city                  0
dtype: int64

In [16]:
df['No. of Bedrooms'].unique()

array([4, 2, 3, 1, 5, 8, 6], dtype=int64)

In [17]:
df.Gymnasium.unique()

array([1, 0], dtype=int64)

In [18]:
df.SwimmingPool.unique()

array([1, 0], dtype=int64)

In [19]:
df.city.value_counts()

Hyderabad    1785
Chennai      1694
Bangalore    1574
Delhi        1535
Mumbai       1095
Kolkata        55
Name: city, dtype: int64

In [20]:
df.corr()

,Price,Area,No. of Bedrooms,Gymnasium,SwimmingPool,IndoorGames,ClubHouse,CarParking,Hospital,Children'splayarea,LiftAvailable,GolfCourse
Price,1.000000,0.668806,0.449566,0.136198,0.153012,0.100685,0.157559,0.143646,0.048720,0.146209,0.070039,0.085496
Area,0.668806,1.000000,0.728212,0.259334,0.296112,0.228073,0.289509,0.129558,0.015708,0.292820,0.112404,0.059922
No. of Bedrooms,0.449566,0.728212,1.000000,0.128472,0.167845,0.144347,0.169208,0.010071,-0.020291,0.183444,0.088737,0.022350
Gymnasium,0.136198,0.259334,0.128472,1.000000,0.758524,0.554787,0.699077,0.379812,0.165733,0.695719,0.366569,0.131461
SwimmingPool,0.153012,0.296112,0.167845,0.758524,1.000000,0.605879,0.725510,0.382010,0.176267,0.652934,0.319409,0.155963
IndoorGames,0.100685,0.228073,0.144347,0.554787,0.605879,1.000000,0.543608,0.378049,0.172152,0.503788,0.223909,0.160174
ClubHouse,0.157559,0.289509,0.169208,0.699077,0.725510,0.543608,1.000000,0.387234,0.180503,0.632095,0.343058,0.164616
CarParking,0.143646,0.129558,0.010071,0.379812,0.382010,0.378049,0.387234,1.000000,0.222627,0.270004,0.309245,0.133462
Hospital,0.048720,0.015708,-0.020291,0.165733,0.176267,0.172152,0.180503,0.222627,1.000000,0.155287,0.109377,0.205206
Children'splayarea,0.146209,0.292820,0.183444,0.695719,0.652934,0.503788,0.632095,0.270004,0.155287,1.000000,0.351188,0.125484
LiftAvailable,0.070039,0.112404,0.088737,0.366569,0.319409,0.223909,0.343058,0.309245,0.109377,0.351188,1.000000,0.069362
GolfCourse,0.085496,0.059922,0.022350,0.131461,0.155963,0.160174,0.164616,0.133462,0.205206,0.125484,0.069362,1.000000

#### House rent dataset

In [21]:
#Load given dataset
data = p.read_csv("House_Rent_Dataset.csv")

In [22]:
data.shape

(4746, 12)

In [23]:
data.City.value_counts()

Mumbai       972
Chennai      891
Bangalore    886
Hyderabad    868
Delhi        605
Kolkata      524
Name: City, dtype: int64

Before drop the given dataset

In [24]:
data.head()

,Posted On,BHK,Rent,Size,Floor,Area Type,Area Locality,City,Furnishing Status,Tenant Preferred,Bathroom,Point of Contact
0,2022-05-18,2,10000,1100,Ground out of 2,Super Area,Bandel,Kolkata,Unfurnished,Bachelors/Family,2,Contact Owner
1,2022-05-13,2,20000,800,1 out of 3,Super Area,"Phool Bagan, Kankurgachi",Kolkata,Semi-Furnished,Bachelors/Family,1,Contact Owner
2,2022-05-16,2,17000,1000,1 out of 3,Super Area,Salt Lake City Sector 2,Kolkata,Semi-Furnished,Bachelors/Family,1,Contact Owner
3,2022-07-04,2,10000,800,1 out of 2,Super Area,Dumdum Park,Kolkata,Unfurnished,Bachelors/Family,1,Contact Owner
4,2022-05-09,2,7500,850,1 out of 2,Carpet Area,South Dum Dum,Kolkata,Unfurnished,Bachelors,1,Contact Owner

In [25]:
#shape
data.shape

(4746, 12)

After drop the given dataset

In [26]:
df=data.dropna()

In [27]:
#shape
df.shape

(4746, 12)

In [28]:
#show columns
df.columns

Index(['Posted On', 'BHK', 'Rent', 'Size', 'Floor', 'Area Type',
       'Area Locality', 'City', 'Furnishing Status', 'Tenant Preferred',
       'Bathroom', 'Point of Contact'],
      dtype='object')

In [29]:
#To describe the dataframe
df.describe()

               BHK          Rent         Size     Bathroom
count  4746.000000  4.746000e+03  4746.000000  4746.000000
mean      2.083860  3.499345e+04   967.490729     1.965866
std       0.832256  7.810641e+04   634.202328     0.884532
min       1.000000  1.200000e+03    10.000000     1.000000
25%       2.000000  1.000000e+04   550.000000     1.000000
50%       2.000000  1.600000e+04   850.000000     2.000000
75%       3.000000  3.300000e+04  1200.000000     2.000000
max       6.000000  3.500000e+06  8000.000000    10.000000

In [30]:
#Checking datatype and information about dataset
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4746 entries, 0 to 4745
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Posted On          4746 non-null   object
 1   BHK                4746 non-null   int64
 2   Rent               4746 non-null   int64
 3   Size               4746 non-null   int64
 4   Floor              4746 non-null   object
 5   Area Type          4746 non-null   object
 6   Area Locality      4746 non-null   object
 7   City               4746 non-null   object
 8   Furnishing Status  4746 non-null   object
 9   Tenant Preferred   4746 non-null   object
 10  Bathroom           4746 non-null   int64
 11  Point of Contact   4746 non-null   object
dtypes: int64(4), object(8)
memory usage: 445.1+ KB

Checking duplicate values of dataframe

In [31]:
#Checking for duplicate data
df.duplicated()

0       False
1       False
2       False
3       False
4       False
        ...
4741    False
4742    False
4743    False
4744    False
4745    False
Length: 4746, dtype: bool

In [32]:
#find sum of duplicate data
sum(df.duplicated())

0

In [33]:
#Checking sum of missing values
df.isnull().sum()

Posted On            0
BHK                  0
Rent                 0
Size                 0
Floor                0
Area Type            0
Area Locality        0
City                 0
Furnishing Status    0
Tenant Preferred     0
Bathroom             0
Point of Contact     0
dtype: int64

In [34]:
df['BHK'].unique()

array([2, 1, 3, 6, 4, 5], dtype=int64)

In [35]:
df['Area Type'].unique()

array(['Super Area', 'Carpet Area', 'Built Area'], dtype=object)

In [36]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4746 entries, 0 to 4745
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Posted On          4746 non-null   object
 1   BHK                4746 non-null   int64
 2   Rent               4746 non-null   int64
 3   Size               4746 non-null   int64
 4   Floor              4746 non-null   object
 5   Area Type          4746 non-null   object
 6   Area Locality      4746 non-null   object
 7   City               4746 non-null   object
 8   Furnishing Status  4746 non-null   object
 9   Tenant Preferred   4746 non-null   object
 10  Bathroom           4746 non-null   int64
 11  Point of Contact   4746 non-null   object
dtypes: int64(4), object(8)
memory usage: 445.1+ KB

In [37]:
df['BHK'].unique()

array([2, 1, 3, 6, 4, 5], dtype=int64)

In [38]:
df['City'].value_counts()

Mumbai       972
Chennai      891
Bangalore    886
Hyderabad    868
Delhi        605
Kolkata      524
Name: City, dtype: int64

In [39]:
df.corr()

               BHK      Rent      Size  Bathroom
BHK       1.000000  0.369718  0.716145  0.794885
Rent      0.369718  1.000000  0.413551  0.441215
Size      0.716145  0.413551  1.000000  0.740703
Bathroom  0.794885  0.441215  0.740703  1.000000